app/controllers/products_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"  WHERE "products"."seller" = 1 AND "products"."buyer" IS NULL
SELECT "products".* FROM "products"  WHERE "products"."buyer" = 2
SELECT "products"."amount" FROM "products"  WHERE "products"."buyer" = 1
SELECT "products".* FROM "products"
---
  def index
    @users = User.all
    @user = User.find(session[:user_id])
    @product = Product.where(seller: session[:user_id], buyer:nil)
    @purchases = Product.where(buyer:session[:user_id])
    @add_purchases = Product.where(buyer:session[:user_id]).pluck(:amount)

    # if session user and buyer are in the same row
    @sales = Product.all

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
SELECT  "products".* FROM "products"  WHERE "products"."id" = 2 LIMIT 1
---
  def remove
    Product.find_by(id: params[:id]).destroy

INSERT INTO "products" ("amount", "created_at", "product", "seller", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 22], ["created_at", "2016-09-28 19:12:34.549924"], ["product", "shoes"], ["seller", 1], ["updated_at", "2016-09-28 19:12:34.549924"]]
---
  def sell
    Product.create(product:params[:name], amount:params[:amount], seller:session[:user_id])