app/controllers/show_all_controller.rb

  def index
    @products = Product.where(buyer:nil)
    @users = User.all
---
SELECT "products".* FROM "products"  WHERE "products"."buyer" IS NULL
SELECT "users".* FROM "users"

  def buy
    Product.find_by(id: params[:id]).update(buyer: session[:user_id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "buyer" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["buyer", 2], ["updated_at", "2016-09-28 20:21:27.933306"]]