app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def register
  	user = User.new(first_name:params[:first_name], last_name:params[:last_name], email:params[:email], password:params[:password])
  	if user.valid?
  		user.save

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'joe@dojo.com' LIMIT 1
---
  def login
  	if !params[:email].blank? && !params[:password].blank?
  		user = User.find_by_email(params[:email])